In [1]:
import pandas as pd
from pandas import Series
from pandas import DataFrame

import numpy as np

# Series addtion operation

In [2]:
s1 = Series(range(1,6), index = list("abced"))
s1

a    1
b    2
c    3
e    4
d    5
dtype: int64

In [3]:
s2 = Series(range(5,11), index = list("bcedef"))
s2

b     5
c     6
e     7
d     8
e     9
f    10
dtype: int64

In [7]:
# 시리즈 넘버와 일치하는 값은 결과를 출력하고
# 시리즈 넘버의 값이 존재하지 않으면 nan값 출력
print(s1+s2)
print()
print(s1.add(s2))

a     NaN
b     7.0
c     9.0
d    13.0
e    11.0
e    13.0
f     NaN
dtype: float64

a     NaN
b     7.0
c     9.0
d    13.0
e    11.0
e    13.0
f     NaN
dtype: float64

In [8]:
# 시리즈 넘버의 값이 존재하지 않을 경우 0을 넣고 출력
s1.add(s2, fill_value=0)

a     1.0
b     7.0
c     9.0
d    13.0
e    11.0
e    13.0
f    10.0
dtype: float64

# dataframe operation

In [15]:
df1 = DataFrame(np.arange(9).reshape(3,3), columns=list("abc"))
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [13]:
df2 = DataFrame(np.arange(16).reshape(4,4), columns=list("abcd"))
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [18]:
# df2나 df1의 값이 하나라도 없으면 nan값 출력
print(df1+df2)

df1.add(df2, fill_value=0)

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

# operations for dataframe with series

In [19]:
df = DataFrame(np.arange(16).reshape(4,4), columns=list("abcd"))
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [20]:
# 시리즈는 attribution 속성임!!!
# index랑 개념 다름!!

s = Series(np.arange(10,14), index = list("abcd"))
s

a    10
b    11
c    12
d    13
dtype: int32

In [21]:
df+s

    a   b   c   d
0  10  12  14  16
1  14  16  18  20
2  18  20  22  24
3  22  24  26  28

In [22]:
s2 = Series(np.arange(10,14))
s2

0    10
1    11
2    12
3    13
dtype: int32

In [23]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [24]:
# 시리즈 넘버 abcd에 없는 속성인 0123을 더하면
# 값이 없다고 뜸!
df+s2

    a   b   c   d   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

In [26]:
# 시리즈 넙버와 같이 다른 값을 더해줄 경우
# axis=0으로 행으로 변환해 더해줘야
#원하는 결과 얻을 수 있음

df.add(s2, axis=0)

    a   b   c   d
0  10  11  12  13
1  15  16  17  18
2  20  21  22  23
3  25  26  27  28